#============================================================================================================
#	拡張機能 - 無効バイトシーケンス除去
#	0ch_delfc.pl
#	--------------------------------------------------------------------------------------------
#	かんりぶれ★ with ﾘ*"ﾌ")ﾚ の みんな ( https://boumou.li/ )
#
#	Last up date 2024.08.09
#============================================================================================================
package ZPL_delfc;

use Encode;
#------------------------------------------------------------------------------------------------------------
#	拡張機能名称取得
#------------------------------------------------------------------------------------------------------------
sub getName
{
	return '無効バイトシーケンス除去';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能説明取得
#------------------------------------------------------------------------------------------------------------
sub getExplanation
{
	return '無効なバイトシーケンスを除去';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能タイプ取得
#------------------------------------------------------------------------------------------------------------
sub getType
{
	return 16;
}

#------------------------------------------------------------------------------------------------------------
#	設定リスト取得 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub getConfig
{
	return {
		'is_replace_vs16' => {
			'default' => 1,
			'valuetype' => 3,
			'description' => '異体字セレクタと思われるバイト列をVS-16(U+FE0F)で置換します。',
		}
	};
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能実行インタフェイス
#------------------------------------------------------------------------------------------------------------
sub execute
{
	my $this = shift;
	my ($Sys, $Form, $type) = @_;
	
	# 0ch本家では実行しない
	return 0 if (!$this->{'is0ch+'});
	
	# フォームを取得
	my $msg = $Form->Get('MESSAGE');
	my $name = $Form->Get('FROM');
	my $mail = $Form->Get('MAIL');
	my $tt = $Form->Get('subject');

	my $replacement_str = $this->GetConf('is_replace_vs16') ? '&#65039;' : '';

	# 本文
	$msg = replace_cmd($msg, $replacement_str);
	$Form->Set('MESSAGE', $msg);

	# 名前欄
	if ($name ne '') {
		$name = replace_cmd($name, $replacement_str);
		$Form->Set('FROM', $name);
	}

	# メール欄
	if ($mail ne '') {
		$name = replace_cmd($mail, '');
		$Form->Set('MAIL', $mail);
	}
	
	# スレタイ
	if ($tt ne '') {
		$tt = replace_cmd($tt, $replacement_str);
		$Form->Set('subject', $tt);
	}
	
	return 0;
}

#------------------------------------------------------------------------------------------------------------
#	無効なバイトシーケンス除去処理
#------------------------------------------------------------------------------------------------------------
sub replace_cmd
{
	my $text = shift;
	my $replacement_str = shift;

	# 無効なバイトシーケンスが含まれているかチェック
	my $decoded_text;
	eval {
		$decoded_text = $text;
		$decoded_text = Encode::decode('cp932', $decoded_text, Encode::FB_CROAK);
	};

	if ($@) {
		# エラーの場合、文字参照で置換
		$decoded_text = Encode::decode('cp932', $text, Encode::FB_PERLQQ);

		# 0xFCを置換
		$decoded_text =~ s/(\\xFC)+/$replacement_str/g;
		
		return Encode::encode('cp932', $decoded_text);
	}

	# 無効なバイトシーケンスがなければそのまま返す
	return $text;
}

#------------------------------------------------------------------------------------------------------------
#	コンストラクタ
#------------------------------------------------------------------------------------------------------------
sub new
{
	my $class = shift;
	my ($Config) = @_;
	
	my $this = {};
	bless $this, $class;
	
	if (defined $Config) {
		$this->{'PLUGINCONF'} = $Config;
		$this->{'is0ch+'} = 1;
	}
	else {
		$this->{'CONFIG'} = $class->getConfig();
		$this->{'is0ch+'} = 0;
	}
	
	return $this;
}

#------------------------------------------------------------------------------------------------------------
#	設定値取得 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub GetConf
{
	my $this = shift;
	my ($key) = @_;
	if ($this->{'is0ch+'}) {
		return $this->{'PLUGINCONF'}->GetConfig($key);
	}
	elsif (defined $this->{'CONFIG'}->{$key}) {
		return $this->{'CONFIG'}->{$key}->{'default'};
	}
}

#------------------------------------------------------------------------------------------------------------
#	設定値設定 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub SetConf
{
	my $this = shift;
	my ($key, $val) = @_;
	if ($this->{'is0ch+'}) {
		$this->{'PLUGINCONF'}->SetConfig($key, $val);
	}
	elsif (defined $this->{'CONFIG'}->{$key}) {
		$this->{'CONFIG'}->{$key}->{'default'} = $val;
	}
	else {
		$this->{'CONFIG'}->{$key} = { 'default' => $val };
	}
}

#============================================================================================================
#	Module END
#============================================================================================================
1;
